package com.bambooJohn.demo;

public class Demo {

	/**
	 * HTTP
	 * 	* 简介：Hypertext transfer protocol
	 * 	* 报文：客户端与服务端通信时传输的内容我们称之为报文
	 * 		* 请求报文
	 * 		* 响应报文
	 * 	* HTTP协议的会话方式		
	 * 		1.建立连接
	 * 		2.发送请求
	 * 		3.做出响应
	 * 		4.关闭连接
	 * 	* HTTP1.0（短连接）和HTTP1.1（长连接）的区别
	 * 	* 报文格式
	 * 		* 请求报文
	 * 			* GET请求报文
	 * 				* 请求行：请求方式 请求地址 请求http版本
	 * 				* 请求头：详细信息
	 * 			* POST请求报文
	 * 				* 请求行：请求方式 请求地址 请求http版本
	 * 				* 请求头：详细信息
	 * 				* 请求体：请求信息
	 * 		* 响应报文
	 * 			* 响应行：响应http版本	响应码
	 * 			* 响应头：详细信息
	 * 			* 空行
	 * 			* 响应体：响应数据信息
	 * 		* 响应码
	 * 			* 200：请求成功
	 * 			* 404：请求资源没找到
	 * 			* 500：请求资源找到了，服务器内部错误
	 * 			* 302：重定向
	 */
	public static void main(String[] args) {
		
	}
	
}
